benchmarks/Hunt_flow/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
(
    (0 -1 -1) //0
    (20 -1 -1) //1
    (20 1 -1) //2
    (0 1 -1) //3
    (0 -1 1) //4
    (20 -1 1) //5
    (20 1 1) //6
    (0 1 1) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 50) simpleGrading (
							1
 							(
 							(50 50 5)
 							(50 50 0.2)
 							)
 							(
 							(50 50 5)
 							(50 50 0.2)
 							)
 							)
);

edges
(
);

boundary
(
    inlet
    {
 	type patch;
	faces
 	(
 	(0 4 7 3)
 	);
    }

    outlet
    {
 	type patch;
 	faces
 	(
 	(2 6 5 1)
 	);
     }
     lowerWall
 	{
 	type patch;
 	faces
 	(
 	(1 5 4 0)
 	);
     }
     upperWall
     {
 	type patch;
 	faces
 	(
 	(3 7 6 2)
 	);
      }
      rightWall
      {
 	type patch;
 	faces
 	(
 	(4 5 6 7)
	);
      }
      leftWall
      {
 	type patch;
 	faces
 	(
 	(0 3 2 1)
 	);
      }
);

mergePatchPairs
(
);

// ************************************************************************* //
