benchmarks/Hunt_flow/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver          GAMG;
        smoother	GaussSeidel;
        maxIter		100;
	nCellsCoarsestLevel 155;
	tolerance       1e-06;
        relTol          0;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol          0;
    }

    pB
    {
        $p_rgh;
        tolerance       1e-05;
        relTol          0;
    }

    pBFinal
    {
        $pB;
        relTol          0;
    }

    "(rho|U|e|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
	maxIter		50;
        tolerance       1e-06;
        relTol          0;
    }

    "(rho|U|e|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }

    B
    {
        solver          GAMG;
        smoother        GaussSeidel;
	maxIter		100;
	nCellsCoarsestLevel 155;
        tolerance       1e-07;
        relTol          0;
    }

    BFinal
    {
        $B;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor   yes;
    transonic           no;
    nOuterCorrectors    10;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    simpleRho           yes;

    pRefCell       	0;
    pRefValue      	1e5;
    pMaxFactor      1.5;
    pMinFactor      0.9;

    outerCorrectorResidualControl
    {
	p_rgh
	{
	    relTol	    0;
	    tolerance	    0.01;
	}

	e
	{
	    relTol	    0;
	    tolerance	    0.005;
	}

        "(U|k|epsilon)"
        {
            relTol          0;
            tolerance       0.005;
        }
    }

    turbOnFinalIterOnly no;
}

relaxationFactors
{
    fields
    {
        p_rgh           0.3;
        rho             1;
    }
    equations
    {
        U               0.9;
        e               0.5;
        "(k|epsilon|omega)" 0.9;
    }
}

BPISO
{
    nCorrectors		2;
}


// ************************************************************************* //
