benchmarks/Hunt_flow/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

parallel=true

application=$(getApplication)

cp -r 0.orig 0
#cp -r 0.steadyState 0

runApplication blockMesh


if $parallel;
then
    runApplication decomposePar
    runParallel renumberMesh -overwrite -parallel
    runParallel -append $application
    runApplication -append reconstructPar -newTimes
else
    runApplication renumberMesh -overwrite
    runApplication -append $application
fi

#------------------------------------------------------------------------------
